
from schema import validator
from algo import run
from ahp_reporter import MarkdownReporter
# ← сюда вставить текст реального CSV-файла
# Для теста используем сокращённый пример (9 альтернатив, 4 критерия)
CSV_EXAMPLE = """\
AHP;Легенда;;;;;;Сравнительная таблица важности критериев относительно друг друга;;;;;;;;;;;;;;;;;;;;
;Цвет;Тип пользовательского ввода;;;;;;ЦЕНА;РАЗМЕР;КОМНАТЫ;БЛИЗОСТЬ;КАТЕГОРИЯ;0;0;0;0;;;;;;;;;;;
;;строка;;;;;ЦЕНА;1;3;1;0,5;5;;;;;;;;;;;;;;;
;;целое число от 0 до 5;;;;;РАЗМЕР;0,333333333;1;0,25;0,14;2;;;;;;;;;;;;;;;
;;произвольное число;;;;;КОМНАТЫ;1;4;1;1;6;;;;;;;;;;;;;;;
;;0 или 1;;;;;БЛИЗОСТЬ;2;7;1;1;8;;;;;;;;;;;;;;;
;;;;;;;КАТЕГОРИЯ;0,2;0,5;0,166666667;0,125;1;;;;;;;;;;;;;;;
AHP;Названия альтернатив;;;Названия критериев;;;;;;;;;;;;;;;;;;;;;;;
;Альтернатива;Название альтернативы;;Критерий;Название критерия;;;;;;;;;;;;;;;;;;;;;;
;А1;КВАРТИРА 1;;К1;ЦЕНА;;;;;;;;;;;;;;;;;;;;;;
;А2;КВАРТИРА 2;;К2;РАЗМЕР;;;;;;;;;;;;;;;;;;;;;;
;А3;КВАРТИРА 3;;К3;КОМНАТЫ;;;;;;;;;;;;;;;;;;;;;;
;;;;K4;БЛИЗОСТЬ;;;;;;;;;;;;;;;;;;;;;;
;;;;К5;КАТЕГОРИЯ;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;
AHP;;;;;;;Значения критериев;;;;;;;;;;;;;;;;;;;;
;;;;;;;;КВАРТИРА 1;КВАРТИРА 2;КВАРТИРА 3;0;0;0;0;0;0;;;;;;;;;;;Сортировать по возрастанию?
;;;;;;;ЦЕНА;333;100;500;;;;;;;;;;;;;;;;;0
;;;;;;;РАЗМЕР;800;1400;30;;;;;;;;;;;;;;;;;1
;;;;;;;КОМНАТЫ;22,9;25,9;10;;;;;;;;;;;;;;;;;1
;;;;;;;БЛИЗОСТЬ;31,1;70;10;;;;;;;;;;;;;;;;;1
;;;;;;;КАТЕГОРИЯ;17;10;73;;;;;;;;;;;;;;;;;1
"""

def main():

    parsed = validator({"csv": CSV_EXAMPLE})

    reporter = MarkdownReporter()

    run(parsed, reporter)

    markdown = reporter.get_markdown()

    # сохраняем файл
    with open("ahp_report.md", "w", encoding="utf-8") as f:
        f.write(markdown)

    print("Отчёт сохранён в файл ahp_report.md")

if __name__ == "__main__":
    main()