from schema import validator
from algo import run
from csm_reporter import MarkdownReporter

'''CSV_EXAMPLE = """\
AES;Легенда;;;;
;Цвет;Тип пользовательского ввода;;;Количество переменных
;;целое число от 1 до 5;;;3
;;функция с переменными x1, x2, ..., x5;;;
;;>= или = или <=;;;
;;произвольное число;;;
;;0 или 1;;;
;;;;;
;;Параметры целевых функций;;;
;;Функция;Правая часть;Максимум;Уступка
;;2x1+x2-3x3;0;1;4
;;x1+3x2-2x3;0;0;5
;;-x1+2x2+4x3;0;1;
;;;;;
;;;;;
;;;;;
;AES;;;;
;;Параметры функций ограничений;;;
;;Функция;Знак сравнения;Правая часть;
;;x1+3x2+2x3;>=;1;
;;2x1-x2+x3;<=;16;
;;x1+2x2;<=;24;
;;x1;>=;0;
;;x2;>=;0;
;;x3;>=;0;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;AES
"""
'''

CSV_EXAMPLE = """\
CSM;Легенда;;;;
;Цвет;Тип пользовательского ввода;;;Количество переменных
;;целое число от 1 до 5;;;2
;;функция с переменными x1, x2, ..., x5;;;
;;>= или = или <=;;;
;;произвольное число;;;
;;0 или 1;;;
;;;;;
;;Параметры целевых функци;;;
;;Функция;Правая часть;Максимум;Уступка
;;x1-3x2;0;1;2
;;2x1 -2x2;0;0;
;;;;;
;;;;;
;;;;;
;;;;;
;CSM;;;;
;;Параметры функций ограничений;;;
;;Функция;Знак сравнения;Правая часть;
;;3x1+5x2;>=;2;
;;x1+x2;<=;11;
;;x1-x2;<=;-1;
;;x1;>=;0;
;;x2;>=;0;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;
;;;;;CSM
"""

def main():
    parsed = validator({"csv": CSV_EXAMPLE})
    reporter = MarkdownReporter()
    run(parsed, reporter)
    markdown = reporter.get_markdown()

    with open("csm_report.md", "w", encoding="utf-8") as f:
        f.write(markdown)

    print("Отчёт сохранён в файл csm_report.md")


if __name__ == "__main__":
    main()