from __future__ import annotations

from schema import validate_input as validator
from algo import run

from app.reporting.reporter import MarkdownReporter


# ПРОВЕРКА РАБОТЫ АЛГОРИТМА И ГЕНЕРАЦИИ ОТЧЕТА
CSV_EXAMPLE = """\
FREL;Легенда;;;;;;Нечеткое отношение R1(Y, X);;;;;;;;;;;;;;;;;;;;
;Цвет;Тип пользовательского ввода;;;;;Y \\ X;Менеджер;Программист;Водитель;Секретарь-референт;Переводчик;X6;X7;X8;X9;X10;X11;X12;X13;X14;X15;X16;X17;X18;X19;
;;строка;;;;;Быстрота и гибкость мышления;0,9;0,8;0.3;0.5;0,7;;;;;;;;;;;;;;;
;;число от 0 до 1;;;;;Умение быстро принимать решения;0,9;0,5;0,9;0,4;0,8;;;;;;;;;;;;;;;
;;;;;;;Устойчивость и концентрация внимания;0,8;0,9;0,6;0,5;0,8;;;;;;;;;;;;;;;
;;;;;;;Зрительная память;0,4;0,3;0,5;0,5;0,2;;;;;;;;;;;;;;;
;;;;;;;Быстрота реакции;0,5;0,1;0,9;0,2;0,6;;;;;;;;;;;;;;;
FREL;Общее множество Y;;;Множество X;;;Двигательная память;0,3;0,2;0,8;0,2;0,2;;;;;;;;;;;;;;;
;Элемент;Название элемента;;Элемент;Название элемента;;Физическая выносливость;0,6;0,2;0,9;0,3;0,2;;;;;;;;;;;;;;;
;Y1;Быстрота и гибкость мышления;;X1;Менеджер;;Координация движений;0,2;0,2;0,8;0,3;0,3;;;;;;;;;;;;;;;
;Y2;Умение быстро принимать решения;;X2;Программист;;Эмоционально-волевая устойчивость;0,9;0,5;0,6;0,9;0,3;;;;;;;;;;;;;;;
;Y3;Устойчивость и концентрация внимания;;X3;Водитель;;Ответственность;0,8;0,5;0,3;0,8;0,2;;;;;;;;;;;;;;;
;Y4;Зрительная память;;X4;Секретарь-референт;;Y11;;;;;;;;;;;;;;;;;;;;
;Y5;Быстрота реакции;;X5;Переводчик;;Y12;;;;;;;;;;;;;;;;;;;;
;Y6;Двигательная память;;X6;X6;;Y13;;;;;;;;;;;;;;;;;;;;
;Y7;Физическая выносливость;;X7;X7;;Y14;;;;;;;;;;;;;;;;;;;;
;Y8;Координация движений;;X8;X8;;Y15;;;;;;;;;;;;;;;;;;;;
;Y9;Эмоционально-волевая устойчивость;;X9;X9;;Y16;;;;;;;;;;;;;;;;;;;;
;Y10;Ответственность;;X10;X10;;Y17;;;;;;;;;;;;;;;;;;;;
;Y11;Y11;;X11;X11;;Y18;;;;;;;;;;;;;;;;;;;;
;Y12;Y12;;X12;X12;;Y19;;;;;;;;;;;;;;;;;;;;
;Y13;Y13;;X13;X13;;;;;;;;;;;;;;;;;;;;;;
;Y14;Y14;;X14;X14;;Нечеткое отношение R2(Y, Z);;;;;;;;;;;;;;;;;;;;
FREL;Y15;Y15;;X15;X15;;Y \\ Z;Петров;Иванов;Сидоров;Васильева;Григорьева;Z6;Z7;Z8;Z9;Z10;Z11;Z12;Z13;Z14;Z15;Z16;Z17;Z18;Z19;
;Y16;Y16;;X16;X16;;Быстрота и гибкость мышления;0,9;0,8;0,7;0,9;1;;;;;;;;;;;;;;;
;Y17;Y17;;X17;X17;;Умение быстро принимать решения;0,6;0,4;0,8;0,5;0,6;;;;;;;;;;;;;;;
;Y18;Y18;;X18;X18;;Устойчивость и концентрация внимания;0,5;0,2;0,3;0,8;0,7;;;;;;;;;;;;;;;
;Y19;Y19;;X19;X19;;Зрительная память;0,5;0,9;0,5;0,8;0,4;;;;;;;;;;;;;;;
;;;;;;;Быстрота реакции;1;0,6;0,5;0,7;0,4;;;;;;;;;;;;;;;
;Множество Z;;;;;;Двигательная память;0,4;0,5;1;0,7;0,8;;;;;;;;;;;;;;;
;Элемент;Название элемента;;;;;Физическая выносливость;0,5;0,8;0,9;0,5;0,4;;;;;;;;;;;;;;;
;Z1;Петров;;;;;Координация движений;0,5;0,6;0,7;0,6;0,5;;;;;;;;;;;;;;;
;Z2;Иванов;;;;;Эмоционально-волевая устойчивость;0,8;1;0,2;0,5;0,6;;;;;;;;;;;;;;;
;Z3;Сидоров;;;;;Ответственность;0,3;0,5;0,9;0,6;0,8;;;;;;;;;;;;;;;
;Z4;Васильева;;;;;Y11;;;;;;;;;;;;;;;;;;;;
;Z5;Григорьева;;;;;Y12;;;;;;;;;;;;;;;;;;;;
;Z6;Z6;;;;;Y13;;;;;;;;;;;;;;;;;;;;
;Z7;Z7;;;;;Y14;;;;;;;;;;;;;;;;;;;;
;Z8;Z8;;;;;Y15;;;;;;;;;;;;;;;;;;;;
;Z9;Z9;;;;;Y16;;;;;;;;;;;;;;;;;;;;
;Z10;Z10;;;;;Y17;;;;;;;;;;;;;;;;;;;;
;Z11;Z11;;;;;Y18;;;;;;;;;;;;;;;;;;;;
;Z12;Z12;;;;;Y19;;;;;;;;;;;;;;;;;;;;
;Z13;Z13;;;;;;;;;;;;;;;;;;;;;;;;;
;Z14;Z14;;;;;;;;;;;;;;;;;;;;;;;;;
;Z15;Z15;;;;;;;;;;;;;;;;;;;;;;;;;
;Z16;Z16;;;;;;;;;;;;;;;;;;;;;;;;;
;Z17;Z17;;;;;;;;;;;;;;;;;;;;;;;;;
;Z18;Z18;;;;;;;;;;;;;;;;;;;;;;;;;
;Z19;Z19;;;;;;;;;;;;;;;;;;;;;;;;;
"""


def main() -> None:
    parsed = validator(CSV_EXAMPLE)

    reporter = MarkdownReporter()

    run(parsed, reporter)

    markdown = reporter.get_markdown()

    # сохраняем файл
    with open("fuzzy_relations_report.md", "w", encoding="utf-8") as f:
        f.write(markdown)

    print("Отчёт сохранён в файл fuzzy_relations_report.md")


if __name__ == "__main__":
    main()